## Pandas основы

### Pandas - Panel Data Series:
пакет для статичской обработа данных, включает функционал работы с дб и Exel

In [1]:
import pandas as pd

### Тип данных DataFrame - похож на таблицу
### это массив масивов, где строки можно можно представить как столбцы(как индексы в массиве) , а обращение к определенному индексу - это наше указанное значение

In [2]:
df  = pd.DataFrame([
    [i for i in range(100)],
    ['a' +str(i) for i in range(100)]
]
)
df

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
1,a0,a1,a2,a3,a4,a5,a6,a7,a8,a9,...,a90,a91,a92,a93,a94,a95,a96,a97,a98,a99

In [3]:
df.T

     0    1
0    0   a0
1    1   a1
2    2   a2
3    3   a3
4    4   a4
..  ..  ...
95  95  a95
96  96  a96
97  97  a97
98  98  a98
99  99  a99

[100 rows x 2 columns]

In [4]:
df = df.T

In [5]:
df

     0    1
0    0   a0
1    1   a1
2    2   a2
3    3   a3
4    4   a4
..  ..  ...
95  95  a95
96  96  a96
97  97  a97
98  98  a98
99  99  a99

[100 rows x 2 columns]

In [6]:
df = pd.DataFrame({
    'number': [i for i in range(100)],
    'char': ['a'+ str(i) for i in range(100)]
})
df

    number char
0        0   a0
1        1   a1
2        2   a2
3        3   a3
4        4   a4
..     ...  ...
95      95  a95
96      96  a96
97      97  a97
98      98  a98
99      99  a99

[100 rows x 2 columns]

In [7]:
df['number']

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Name: number, Length: 100, dtype: int64

In [8]:
type(df['number'])

pandas.core.series.Series

In [9]:
df[['number','char']]

    number char
0        0   a0
1        1   a1
2        2   a2
3        3   a3
4        4   a4
..     ...  ...
95      95  a95
96      96  a96
97      97  a97
98      98  a98
99      99  a99

[100 rows x 2 columns]

In [10]:
type(df[['number']])

pandas.core.frame.DataFrame

### Обращение к элементам

### Самый простой способ - это обращение к нашим массиввам (Serias)

In [11]:
df['char'][6]

'a6'

### Обращение с помощью метода loc

In [12]:
df.loc[6, 'char']

'a6'

In [13]:
df.loc[6:12:3, ['char']]

   char
6    a6
9    a9
12  a12

In [14]:
df.loc[6:12:3, ['char']]

   char
6    a6
9    a9
12  a12

In [15]:
df.iloc[6:12:3,1]

6    a6
9    a9
Name: char, dtype: object

In [16]:
df.iloc[6:12:3] = 'test'
df

C:\Users\Админ\AppData\Local\Temp\ipykernel_15416\864771138.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'test' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.iloc[6:12:3] = 'test'

   number char
0       0   a0
1       1   a1
2       2   a2
3       3   a3
4       4   a4
..    ...  ...
95     95  a95
96     96  a96
97     97  a97
98     98  a98
99     99  a99

[100 rows x 2 columns]

In [17]:
df.iloc[6:12:3]

  number  char
6   test  test
9   test  test

### Функции фильтрации

In [18]:
df.query('char == "test"')

  number  char
6   test  test
9   test  test

In [19]:
df.loc[df.char == 'test']

  number  char
6   test  test
9   test  test

### Изменение значений в дата фрейме

In [24]:
df

   number char
0       0   a0
1       1   a1
2       2   a2
3       3   a3
4       4   a4
..    ...  ...
95     95  a95
96     96  a96
97     97  a97
98     98  a98
99     99  a99

[100 rows x 2 columns]

In [25]:
df[['char']]

   char
0    a0
1    a1
2    a2
3    a3
4    a4
..  ...
95  a95
96  a96
97  a97
98  a98
99  a99

[100 rows x 1 columns]

### Допустим мы хотим к каждому элементу столбца char прибавить какую-нибудь строку

In [27]:
df.char.apply()

TypeError: Series.apply() missing 1 required positional argument: 'func'

In [30]:
fun = lambda x: x + '_course'

In [31]:
fun('test')

'test_course'

In [32]:
df.char.apply(lambda x: x + '_course' )

0      a0_course
1      a1_course
2      a2_course
3      a3_course
4      a4_course
         ...
95    a95_course
96    a96_course
97    a97_course
98    a98_course
99    a99_course
Name: char, Length: 100, dtype: object

In [33]:
df

   number char
0       0   a0
1       1   a1
2       2   a2
3       3   a3
4       4   a4
..    ...  ...
95     95  a95
96     96  a96
97     97  a97
98     98  a98
99     99  a99

[100 rows x 2 columns]

In [34]:
df.char + '_course'

0      a0_course
1      a1_course
2      a2_course
3      a3_course
4      a4_course
         ...
95    a95_course
96    a96_course
97    a97_course
98    a98_course
99    a99_course
Name: char, Length: 100, dtype: object

In [35]:
df

   number char
0       0   a0
1       1   a1
2       2   a2
3       3   a3
4       4   a4
..    ...  ...
95     95  a95
96     96  a96
97     97  a97
98     98  a98
99     99  a99

[100 rows x 2 columns]

In [36]:
df.char = df.char + '_curse'
df

   number       char
0       0   a0_curse
1       1   a1_curse
2       2   a2_curse
3       3   a3_curse
4       4   a4_curse
..    ...        ...
95     95  a95_curse
96     96  a96_curse
97     97  a97_curse
98     98  a98_curse
99     99  a99_curse

[100 rows x 2 columns]